* 9 var
* a8 - 1 для условия
* a9 - 2 для условия
* b0 - для результата сравнения
* R1 - a1
* a5
* a6
* R2 - a2

* Инициализация
 mvk 0x1, a8
 mvk 0x1, a9

* Условие
* Сравнение чисел без знака
* A8 > A9
 cmpgtu a8, a9, a1
 mv a1, b0

* Если true

* Операция 1
* Вычисление абсолютной величины числа 0xF67C3E4
 [b0] mvk 0xC3E4, a1
 [b0] mvklh 0xF67, a1
 [b0] abs a1, a1


* Если false

* Операция 2
* Вычитание знаковых чисел 0x7C5A8600 - 0x48B05D03
* Результат в R1
 [!b0] mvk 0x8600, a5
 [!b0] mvklh 0x7C5A, a5
 [!b0] mvk 0x5D03, a6
 [!b0] mvklh 0x48B0, a6
 [!b0] sub a5, a6, a1

* Операция 3
* Вычисление абсолютной величины R1
* Результат в R2
 [!b0] abs a1, a2
